app/Controllers/RegisterController.php

INSERT INTO `user` (`username`, `role`, `password`, `is_aktif`) VALUES ('Kaw', 'user', '$2y$10$hxUNIAjpvZVGJlvFfu6W9e7p6K4blE7zqUCSV5wA7phV8Su07tYk.', 'false')
---
    public function register()
    {
        // Mengambil data yang dikirim melalui POST
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        // Validasi data yang diterima
        $validationRules = [
            'username' => 'required|min_length[3]|max_length[50]|is_unique[user.username]',
            'password' => 'required|min_length[6]',
        ];

        if (!$this->validate($validationRules)) {
            // Jika validasi gagal, tampilkan kembali form register dengan pesan error
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Simpan pengguna ke database
        $userModel = new UserModel();
        $userModel->save([
            'username' => $username,
            'role' => 'user',
            'password' => password_hash($password, PASSWORD_DEFAULT),
            'is_aktif' => 'false',
        ]);