app/Controllers/UserController.php

SELECT *
FROM `user`
WHERE `is_aktif` = 'false'
---
    public function index()
    {
        // Mengambil daftar pengguna dari database
        $userModel = new UserModel();
        $users = $userModel->where('is_aktif', 'false')->findAll();